xPREMy/Neurodex/esp32c6_3.0.2.ino
// Flags to start/stop adc_continuous_mode
static volatile bool adc_start_requested = false;
static volatile bool adc_stop_requested = false;

BLECharacteristic *pDataCharacteristic;
BLECharacteristic *pControlCharacteristic;
BLECharacteristic *pBatteryCharacteristic;

// Global sample counter (each sample's packet counter)
uint8_t overallCounter = 0;

// Battery monitoring - stores latest ADC reading from A6
static volatile uint16_t latestBatteryRaw = 0;

// Battery averaging: log one battery ADC value per completed data packet
// Average all collected samples once per battery check interval
static uint32_t batteryWinStartMs = 0;
static uint32_t batteryWinSum = 0;
static uint16_t batteryWinCount = 0;
static uint16_t batteryAvgToSend = 0; // 0 when not ready yet
static uint16_t isCharging = 0;       // 0 when not charging
static uint8_t lastBatteryPct = 255;  // 255 is unset
static uint8_t consecutiveChargingCheck = 3;
static TaskHandle_t ledBlinkTask = NULL;
static volatile int ledBlinkCycles = -1; // -1=off, 0=indefinite, >0 = that many cycles

// Sample assembly state (reset on start/stop/disconnect)
static uint16_t last_vals[NUM_CHANNELS_MAX] = {0};
static uint32_t have_mask = 0;
static inline void resetSampleState()
{
  have_mask = 0;
  for (uint8_t i = 0; i < NUM_CHANNELS_MAX; i++)
  {
    last_vals[i] = 0;
  }
}

// ----- ADC DMA (continuous mode) globals -----
static adc_continuous_handle_t adc_handle = nullptr;
static bool adc_started = false;
static SemaphoreHandle_t adc_data_semaphore = nullptr;
static esp_ble_adv_params_t advParams = {
    .adv_int_min = 0x0128,
    .adv_int_max = 0x0128,
    .adv_type = ADV_TYPE_IND,
    .own_addr_type = BLE_ADDR_TYPE_PUBLIC,
    .channel_map = ADV_CHNL_ALL,
    .adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY};

// Helper macros to parse DMA results as TYPE2 format on C3/C6
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE2
#define ADC_GET_CHANNEL(p) ((p)->type2.channel)
#define ADC_GET_DATA(p) ((p)->type2.data)

// Forward declarations
static void adc_dma_init();
static void adc_dma_start();
static void adc_dma_stop();
static void handle_adc_dma_and_notify();
static inline uint16_t fix_raw_if_needed(uint16_t raw);

// ----- BLE Server Callbacks -----
class MyServerCallbacks : public BLEServerCallbacks
{
  void onConnect(BLEServer *pServer) override
  {
    pixels.setPixelColor(0, pixels.Color(0, PIXEL_BRIGHTNESS, 0)); // Green
    pixels.show();
    digitalWrite(LED_BUILTIN, HIGH);
    vTaskDelay(200 / portTICK_PERIOD_MS);
    digitalWrite(LED_BUILTIN, LOW);

    // Apply -3 dBm to the active connection
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_CONN_HDL0, ESP_PWR_LVL_N3);
    esp_ble_gap_stop_advertising(); // Explicitly stop advertising
  }

  void onDisconnect(BLEServer *pServer) override
  {
    pixels.setPixelColor(0, pixels.Color(PIXEL_BRIGHTNESS, 0, 0)); // Red on disconnect
    pixels.show();
    // Vibrate twice on disconnect
    digitalWrite(LED_BUILTIN, HIGH);
    vTaskDelay(200 / portTICK_PERIOD_MS);
    digitalWrite(LED_BUILTIN, LOW);
    vTaskDelay(100 / portTICK_PERIOD_MS);
    digitalWrite(LED_BUILTIN, HIGH);
    vTaskDelay(200 / portTICK_PERIOD_MS);
    digitalWrite(LED_BUILTIN, LOW);

    streaming = false;
    // Reset payload state and battery states on disconnect
    sampleIndex = 0;
    payload_wr = 0;
    payload_rd = 0;
    payload_full = 0;
    resetSampleState();
    lastBatteryPct = 255;
    isCharging = 0;
    ledBlinkCycles = -1;

    adc_stop_requested = true; // Request stop
    esp_ble_gap_start_advertising(&advParams);
  }
};

// ----- BLE Control Characteristic Callback -----
// Handles incoming commands ("START", "STOP", "WHORU", "STATUS")
class ControlCallback : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *characteristic) override
  {
    String cmd = characteristic->getValue();
    cmd.trim();
    cmd.toUpperCase();

    if (cmd == "START")
    {
      pixels.setPixelColor(0, pixels.Color(0, 0, PIXEL_BRIGHTNESS)); // Blue
      pixels.show();
      overallCounter = 0;
      sampleIndex = 0;
      payload_wr = 0;
      payload_rd = 0;
      payload_full = 0;
      resetSampleState();

      // Start battery averaging window on streaming start
      batteryWinStartMs = millis();
      batteryWinSum = 0;
      batteryWinCount = 0;
      batteryAvgToSend = 0;
      isCharging = 0;
      lastBatteryPct = 255;
      ledBlinkCycles = -1;

      streaming = true;
      adc_start_requested = true; // Request start
    }
    else if (cmd == "STOP")
    {
      pixels.setPixelColor(0, pixels.Color(0, PIXEL_BRIGHTNESS, 0)); // Green
      pixels.show();
      streaming = false;
      resetSampleState();
      adc_stop_requested = true; // Request stop
    }
    else if (cmd == "WHORU")
    {
      characteristic->setValue("NPG-LITE");
      characteristic->notify();
    }
    else if (cmd == "STATUS")
    {
      characteristic->setValue(streaming ? "RUNNING" : "STOPPED");
      characteristic->notify();
    }
    else
    {
      characteristic->setValue("UNKNOWN COMMAND");
      characteristic->notify();
    }
  }
};

void neoPixelTask(void *parameter)
{
  while (true)
  {
    if (ledBlinkCycles == -1)
    {
      vTaskDelay(100 / portTICK_PERIOD_MS);
      continue;
    }

    uint8_t cycles = 0;
    uint8_t fader = 100;
    bool decreasing = true;

    // run indefinitely when ledBlinkCycles == 0, else run ledBlinkCycles times
    while (ledBlinkCycles != -1 && (ledBlinkCycles == 0 || cycles < (uint8_t)ledBlinkCycles))
    {
      pixels.setPixelColor(PIXEL_COUNT - 1, pixels.Color(fader, 0, 0));
      pixels.show();
      vTaskDelay(20 / portTICK_PERIOD_MS);

      if (decreasing)
      {
        fader = fader - 2;
        if (fader < 10)
        {
          decreasing = false;
        }
      }
      else
      {
        fader = fader + 2;
        if (fader > 100)
        {
          decreasing = true;
          cycles++;
        }
      }
    }

    // If it was a finite request, clear neopixel after completion
    if (ledBlinkCycles > 0)
    {
      pixels.clear();
      pixels.show();
      ledBlinkCycles = -1; // stop repeating the 10-cycle blink forever
    }
  }
}

