xPREMy/Neurodex/esp32c6_3.0.2.ino
// -------Battery Functions-------

// Check battery status while streaming and notify every 10 seconds
void checkBatteryAndDisconnect()
{
  if (batteryAvgToSend == 0)
    return;

  float voltage = (batteryAvgToSend / 1000.0) * 2; // for ESP32C6 v0.1
  voltage = voltage - 0.02;
  float percentage = ceil(interpolatePercentage(voltage));

  // Send decreased battery percentage immediately
  // Send increased battery percentage after 4 consecutive increases
  uint8_t currentBatteryPct = (uint8_t)percentage;

  if (lastBatteryPct == 255)
  {
    // First valid percentage
    lastBatteryPct = currentBatteryPct;
    isCharging = 0;
  }
  else if (currentBatteryPct <= lastBatteryPct)
  {
    lastBatteryPct = currentBatteryPct;
    isCharging = 0;
  }
  else // currentBatteryPct > lastBatteryPct
  {
    if (isCharging >= consecutiveChargingCheck)
    {
      lastBatteryPct = currentBatteryPct;
    }
    isCharging++;
  }

  // Send battery percentage as single byte
  uint8_t batteryByte = lastBatteryPct;
  pBatteryCharacteristic->setValue(&batteryByte, 1);
  pBatteryCharacteristic->notify();
  if (percentage > 70.0)
  {
    ledBlinkCycles = -1;
    pixels.setPixelColor(PIXEL_COUNT - 1, pixels.Color(0, PIXEL_BRIGHTNESS, 0)); // Green when above 70%
    pixels.show();
  }
  else if (percentage <= 70.0 && percentage > 20.0)
  {
    ledBlinkCycles = -1;
    pixels.setPixelColor(PIXEL_COUNT - 1, pixels.Color(15, 4, 0)); // Orange when between 20 and 70
    pixels.show();
  }
  else if (percentage <= 20.0 && percentage > 10.0)
  {
    ledBlinkCycles = -1;
    pixels.setPixelColor(PIXEL_COUNT - 1, pixels.Color(PIXEL_BRIGHTNESS, 0, 0)); // Red when below 20%
    pixels.show();
  }
  else if (percentage <= 10.0 && percentage >= STREAMING_MIN_BATTERY)
  {
    ledBlinkCycles = 0; // blink until battery is in the range of 5-10%
  }
  else if (percentage < STREAMING_MIN_BATTERY)
  {
    // Stop streaming
    streaming = false;

    // Stop ADC since loop() won't run again before deep sleep
    adc_dma_stop();

    // Stop advertising to save power while blinking before deep sleep
    esp_ble_gap_stop_advertising();

    // Disconnect BLE client if connected
    if (pBLEServer != nullptr && pBLEServer->getConnectedCount() > 0)
    {
      // Get connection ID from first connected client
      std::map<uint16_t, conn_status_t> peerDevices = pBLEServer->getPeerDevices(false);
      for (auto const &entry : peerDevices)
      {
        uint16_t connId = entry.first;
        pBLEServer->disconnect(connId); // Use public disconnect method
      }
    }
    sleepWhenLowBattery();
  }
}

// Set device to deep sleep when battery is low
void sleepWhenLowBattery()
{
  ledBlinkCycles = 10;         // request 10 cycles (task runs the algo)
  while (ledBlinkCycles != -1) // wait until task finishes
  {
    vTaskDelay(50 / portTICK_PERIOD_MS);
  }
  esp_deep_sleep_start(); // Enter deep sleep after blinking sequence
}

// Check battery on boot and go to deep sleep if battery < BOOT_MIN_BATTERY
void checkInitialBattery()
{
  int count = 0;
  float sum = 0.0;
  unsigned long startMillis = millis();
  while (millis() - startMillis < 100) // Collect battery voltage samples for 100ms
  {
    int analogValue = analogRead(BATTERY_PIN);
    sum += analogValue;
    count++;
  }
  // Avoid divide-by-zero
  if (count == 0)
    return;

  float initialBatteryRaw = sum / count;
  float voltage = (initialBatteryRaw / 1000.0) * 2; // for ESP32C6 v0.1
  voltage = voltage - 0.02;
  float initialBatteryPercentage = ceil(interpolatePercentage(voltage)); // Calculate battery percentage from LUT

  // If battery is low, slowly blink the neopixel
  if (initialBatteryPercentage < BOOT_MIN_BATTERY)
  {
    sleepWhenLowBattery();
  }
}

// --------Check Playmate-------

void checkPlaymate()
{
  pinMode(LED_BUILTIN, INPUT_PULLUP);
  pinMode(BUZZER_PIN, INPUT_PULLUP);
  if(digitalRead(LED_BUILTIN) == HIGH && digitalRead(BUZZER_PIN) == HIGH)
  {
    Playmate = PROTO_PLAYMATE;
  }
  else
  {
    Playmate = VIBZ_PLAYMATE; // Assume Vibz until Vibz Plus is detected
    // Check for Vibz Plus Playmate
    pinMode(A3, INPUT_PULLUP);
    pinMode(A4, INPUT_PULLUP);
    pinMode(A5, INPUT_PULLUP);
    unsigned long start = millis();
    while (millis() - start < 100) 
    {
      if (digitalRead(A3) == LOW || digitalRead(A4) == LOW || digitalRead(A5) == LOW) 
      {
        Playmate = VIBZ_PLUS_PLAYMATE;
        break;
      }
    }
    // Restore high-impedance inputs before ADC use
    pinMode(A3, INPUT);
    pinMode(A4, INPUT);
    pinMode(A5, INPUT);
  }
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);
  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);
  // Configure active channels and packet sizes
  if (Playmate == VIBZ_PLUS_PLAYMATE)
    NUM_CHANNELS = 7;
  else
    NUM_CHANNELS = 4;
  recomputePacketSizes();
}

void setup()
{
  // ----- LEDs -----
  pixels.begin();

  xTaskCreatePinnedToCore(neoPixelTask, "NeoPixelTask", 2048, NULL, 1, &ledBlinkTask, 0);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);

  setCpuFrequencyMhz(80);

  checkPlaymate();

  checkInitialBattery(); // Check initial battery status

  pixels.setPixelColor(0, pixels.Color(PIXEL_BRIGHTNESS, 0, 0)); // Red (power on)
  pixels.show();

  // Create binary semaphore for ADC data ready signaling
  adc_data_semaphore = xSemaphoreCreateBinary();

  if (adc_data_semaphore == nullptr)
  {
    while (1)
      ; // Halt
  }

  esp_read_mac(mac, ESP_MAC_EFUSE_FACTORY);

  // ----- BLE-only memory footprint (free Classic BT) -----
  esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);

  // ----- Initialize BLE -----
  char deviceName[36];
  if (Playmate == VIBZ_PLUS_PLAYMATE)
    sprintf(deviceName, "NPG-Lite-6CH:%02X:%02X", mac[4], mac[5]);
  else
    sprintf(deviceName, "NPG-Lite-3CH:%02X:%02X", mac[4], mac[5]);
  BLEDevice::init(deviceName);

  // Set BLE TX power to -3 dBm for default/advertising/scan
  esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_DEFAULT, ESP_PWR_LVL_N3);
  esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_ADV, ESP_PWR_LVL_N3);
  esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_SCAN, ESP_PWR_LVL_N3);

  // larger MTU for efficiency (doesn't change packet format)
  BLEDevice::setMTU(500);

  pBLEServer = BLEDevice::createServer();
  pBLEServer->setCallbacks(new MyServerCallbacks());
  BLEService *pService = pBLEServer->createService(SERVICE_UUID);

  // Data Characteristic (Notify only) for ADC data
  pDataCharacteristic = pService->createCharacteristic(
      DATA_CHAR_UUID,
      BLECharacteristic::PROPERTY_NOTIFY);
  pDataCharacteristic->addDescriptor(new BLE2902());

  // Control Characteristic (Read/Write/Notify)
  pControlCharacteristic = pService->createCharacteristic(
      CONTROL_CHAR_UUID,
      BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_NOTIFY);
  pControlCharacteristic->setCallbacks(new ControlCallback());

  // Battery Characteristic (Read/Notify)
  pBatteryCharacteristic = pService->createCharacteristic(
      BATTERY_CHAR_UUID,
      BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY);
  pBatteryCharacteristic->addDescriptor(new BLE2902());

