xPREMy/Neurodex/esp32c6_3.0.2.ino
  pService->start();

  // Configure advertising data to include device name
  esp_ble_adv_data_t adv_data = {};
  adv_data.set_scan_rsp = false;
  adv_data.include_name = true;
  adv_data.include_txpower = false;
  adv_data.min_interval = 0x0006;
  adv_data.max_interval = 0x0010;
  adv_data.appearance = 0x00;
  adv_data.manufacturer_len = 0;
  adv_data.p_manufacturer_data = nullptr;
  adv_data.service_data_len = 0;
  adv_data.p_service_data = nullptr;
  adv_data.service_uuid_len = 0;
  adv_data.p_service_uuid = nullptr;
  adv_data.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

  esp_ble_gap_config_adv_data(&adv_data);

  // Stop Arduino's advertising helper and start with our params
  BLEDevice::getAdvertising()->stop(); // if it was started elsewhere
  esp_ble_gap_start_advertising(&advParams);
}

void loop()
{
  
  if (adc_stop_requested)
  {
    adc_dma_stop();
    adc_stop_requested = false;
  }

  // Handle start/stop requests of adc_continuous_mode
  if (adc_start_requested)
  {
    adc_dma_start();
    adc_start_requested = false;
  }

  if (streaming)
  {
    // Battery check only when streaming (every battery check interval)
    unsigned long currentMillis = millis();
    if (currentMillis - lastBatteryCheck >= BATTERY_CHECK_INTERVAL)
    {
      lastBatteryCheck = currentMillis;
      checkBatteryAndDisconnect();
    }

    // Block until semaphore is given by ISR 
    if (xSemaphoreTake(adc_data_semaphore, portMAX_DELAY) == pdTRUE)
    {
      handle_adc_dma_and_notify();
    }
  }
  else
  {
    // Longer delay when idle 
    vTaskDelay(pdMS_TO_TICKS(100));
  }
}

// ----- ADC DMA implementation -----

// Maps physical ADC channel id → logical index 0..NUM_CHANNELS-1
static int8_t hw2idx[10];

static const uint8_t hw_chs_4[4] = {0, 1, 2, 6};          // Configuration for 3 BioAmp Channels
static const uint8_t hw_chs_7[7] = {0, 1, 2, 3, 4, 5, 6}; // Configuration for 6 BioAmp Channels

static void adc_dma_init()
{

  static adc_digi_pattern_config_t pattern[NUM_CHANNELS_MAX];
  const uint8_t *hw_chs = (NUM_CHANNELS == 7) ? hw_chs_7 : hw_chs_4; // Use appropriate channel configuration

  // Build pattern from the single channel list
  for (int i = 0; i < NUM_CHANNELS; i++)
  {
    pattern[i].atten = ADC_ATTEN_DB_11;
    pattern[i].channel = hw_chs[i]; // Use physical channel id
    pattern[i].unit = ADC_UNIT_1;
    pattern[i].bit_width = ADC_BITWIDTH_12;
  }

  for (int i = 0; i < (int)sizeof(hw2idx); i++)
    hw2idx[i] = -1;
  for (int i = 0; i < NUM_CHANNELS; i++)
    hw2idx[hw_chs[i]] = i;

  // Create driver handle and configure continuous conversion
  adc_continuous_handle_cfg_t handle_cfg = {
      .max_store_buf_size = NUM_CHANNELS * SOC_ADC_DIGI_RESULT_BYTES * BLOCK_COUNT * 5,
      .conv_frame_size = NUM_CHANNELS * SOC_ADC_DIGI_RESULT_BYTES * BLOCK_COUNT,
#if defined(ESP_IDF_VERSION) && (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
      .flags = {.flush_pool = 1}, // Only for newer IDF that supports it
#endif
  };
  if (adc_handle == nullptr)
  {
    ESP_ERROR_CHECK(adc_continuous_new_handle(&handle_cfg, &adc_handle));
  }

  adc_continuous_evt_cbs_t cbs = {
      .on_conv_done = [](adc_continuous_handle_t handle,
                         const adc_continuous_evt_data_t *edata,
                         void *user_data) -> bool
      {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xSemaphoreGiveFromISR(adc_data_semaphore, &xHigherPriorityTaskWoken);
        return (xHigherPriorityTaskWoken == pdTRUE); // Yield if higher priority task woken
      },
  };
  ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, nullptr));

  adc_continuous_config_t dig_cfg = {
      .pattern_num = NUM_CHANNELS,
      .adc_pattern = pattern,
      // total sample rate = per-channel * number of channels
      .sample_freq_hz = (uint32_t)(SAMP_RATE * NUM_CHANNELS), // 2000 SPS total
      .conv_mode = ADC_CONV_SINGLE_UNIT_1,
      .format = ADC_OUTPUT_TYPE, // TYPE2 (unit, channel, data)
  };
  ESP_ERROR_CHECK(adc_continuous_config(adc_handle, &dig_cfg));
}

static void adc_dma_start()
{
  // Reinitialize ADC if it was deinited
  if (adc_handle == nullptr)
  {
    adc_dma_init();
  }

  if (adc_handle && !adc_started)
  {
    ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
    adc_started = true;
  }
}

static void adc_dma_stop()
{
  if (adc_handle && adc_started)
  {
    ESP_ERROR_CHECK(adc_continuous_stop(adc_handle));
    adc_started = false;

    // DEINITIALIZE ADC to save power
    ESP_ERROR_CHECK(adc_continuous_deinit(adc_handle));
    adc_handle = nullptr;
  }
}

static inline uint16_t fix_raw_if_needed(uint16_t raw)
{
#if defined(CONFIG_IDF_TARGET_ESP32C6)
  // Optional: match your prior scaling workaround for C6 rev1 if needed
  if (chiprev == 1)
  {
    // scale raw (0..~3249) to 0..4095
    uint32_t v = (uint32_t)raw * 4095u / 3249u;
    if (v > 4095u)
      v = 4095u;
    return (uint16_t)v;
  }
#endif
  return raw;
}

static void handle_adc_dma_and_notify()
{
  // Assemble Channel data into sample packets
  // use global last_vals/have_mask
  const uint32_t FULL_MASK = (1u << NUM_CHANNELS) - 1;
  uint8_t dma_buf[NUM_CHANNELS_MAX * SOC_ADC_DIGI_RESULT_BYTES * BLOCK_COUNT];

  // Drain ADC driver until empty OR until our payload buffers are full
  while (payload_full < BLE_PAYLOAD_BUFFERS)
  {
    // Read whatever DMA has buffered
    uint32_t ret_len = 0;

    esp_err_t ret = adc_continuous_read(adc_handle, dma_buf, sizeof(dma_buf), &ret_len, 0);
    if (ret != ESP_OK || ret_len == 0)
    {
      break;
    }

    for (uint32_t i = 0; i + SOC_ADC_DIGI_RESULT_BYTES <= ret_len; i += SOC_ADC_DIGI_RESULT_BYTES)
    {
      auto *p = (const adc_digi_output_data_t *)&dma_buf[i];
      uint8_t ch_hw = ADC_GET_CHANNEL(p); // physical channel id from TYPE2
      uint16_t raw = ADC_GET_DATA(p);

      // map physical channel → logical index (0..NUM_CHANNELS-1)
      int8_t idx = (ch_hw < (uint8_t)sizeof(hw2idx)) ? hw2idx[ch_hw] : -1;
      if (idx >= 0 && idx < (int8_t)NUM_CHANNELS)
      {
        // Apply fix only to BioAmp channels (A0-A5), NOT battery (A6)
        if (idx < (NUM_CHANNELS - 1))
        {
          last_vals[idx] = fix_raw_if_needed(raw);
        }
        else
        {
          last_vals[idx] = raw; // Battery channel: use raw value
        }
        have_mask |= (1u << idx);

        // Track latest battery raw for reference/debug (averaging happens per completed packet)
        if (idx == (NUM_CHANNELS - 1))
        {
          latestBatteryRaw = last_vals[idx];
        }
      }

      // When we have all channels, emit one record into current payload buffer
      if (have_mask == FULL_MASK)
      {
        // If all payload buffers are full, stop reading
        if (payload_full >= BLE_PAYLOAD_BUFFERS)
        {
          have_mask = 0;
          break;
        }

        // Calculate offset in blePayload buffer
        uint16_t offset = sampleIndex * SINGLE_SAMPLE_LEN;

        // Write counter directly to blePayload buffer
        blePayload[payload_wr][offset] = overallCounter;
        overallCounter = (overallCounter + 1) & 0xFF;

        // Big-endian packing directly to blePayload buffer
        for (uint8_t c = 0; c < NUM_CHANNELS - 1; c++)
        {
          uint16_t v = last_vals[c];
          blePayload[payload_wr][offset + 1 + c * 2] = (uint8_t)((v >> 8) & 0xFF);
          blePayload[payload_wr][offset + 1 + c * 2 + 1] = (uint8_t)(v & 0xFF);
        }

        sampleIndex++;

        if (sampleIndex >= BLOCK_COUNT)
        {
          sampleIndex = 0;

          // Log one battery ADC value per completed packet
          if (NUM_CHANNELS > 0)
          {
            uint16_t batt = last_vals[NUM_CHANNELS - 1];
            batteryWinSum += batt;
            batteryWinCount++;
          }

          // Every BATTERY_CHECK_INTERVAL, compute window average and update latch (decreasing-only)
          uint32_t nowMs = millis();
          if ((uint32_t)(nowMs - batteryWinStartMs) >= (uint32_t)BATTERY_CHECK_INTERVAL)
          {
            if (batteryWinCount > 0)
            {
              uint16_t currentAvg = (uint16_t)(batteryWinSum / batteryWinCount);
              batteryAvgToSend = currentAvg;
            }

            // Reset window
            batteryWinStartMs = nowMs;
            batteryWinSum = 0;
            batteryWinCount = 0;
          }

          payload_full++;
          payload_wr = (payload_wr + 1) % BLE_PAYLOAD_BUFFERS;

          // If all payload buffers are full, stop reading
          if (payload_full >= BLE_PAYLOAD_BUFFERS)
          {
            have_mask = 0;
            break;
          }
        }

        have_mask = 0; // reset for next triplet
      }
    }
  }
  while (payload_full > 0 && streaming)
  {
    pDataCharacteristic->setValue(blePayload[payload_rd], NEW_PACKET_LEN);
    pDataCharacteristic->notify();

    payload_rd = (uint8_t)((payload_rd + 1) % BLE_PAYLOAD_BUFFERS);
    payload_full--;
  }
}